{
  "backend/main.mo": "Defines the main backend actor with storage and authorization mixins plus all core domain types for schools, staff, payments, packing, and training visits.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requirements to impacted frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Contains pre-written summaries describing behavior and responsibilities of various frontend pages, hooks, and components.",
  "frontend/index.css": "Defines global Tailwind CSS variables for light and dark themes along with base styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the root React application and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the React app with TanStack Router, React Query client, theming, and global toasts.",
  "frontend/src/components/demo/DemoDataUnavailableState.tsx": "Renders an alert explaining missing Demo/Preview Mode data using configurable messaging.",
  "frontend/src/components/demo/DemoPreviewBanner.tsx": "Displays the Demo/Preview Mode banner with role switcher, data‑reset warning, and light/dark‑mode‑safe styling.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout that loads user profile, shows role‑based navigation, and includes demo mode banner and logout menu.",
  "frontend/src/components/layout/RoleNav.tsx": "Renders role-based navigation links with active-state styling and optional mobile behavior.",
  "frontend/src/components/schools/SchoolSearchPanel.tsx": "Provides searchable school list with filters and role-specific action links, showing loading skeletons or results table.",
  "frontend/src/demo/demoDataStore.ts": "Implements localStorage-backed demo data persistence for schools and other domain records with reset detection.",
  "frontend/src/demo/demoGuards.ts": "Defines demo-mode mutation rules and helpers to allow or block specific actions.",
  "frontend/src/demo/demoProfile.ts": "Generates synthetic user profiles for each staff role in demo mode.",
  "frontend/src/demo/demoRoutes.ts": "Maps staff roles to their corresponding demo dashboard routes.",
  "frontend/src/demo/demoSession.ts": "Manages demo-mode session state in localStorage including activation, role, and credential validation.",
  "frontend/src/demo/useDemoPreview.ts": "Hook exposing demo-mode state and functions to set role or exit demo mode with storage events.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, schools, payments, packing, training, and academic data, with demo-mode fallbacks. Defines a local Payment interface and integrates with an actor-based backend.",
  "frontend/src/index.css": "Defines Tailwind base layers and a full set of CSS variables for light and dark themes using OKLCH color values. Applies global border, background, and text styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers. Loads global styles and renders the root App component.",
  "frontend/src/pages/academic/AcademicQueriesPage.tsx": "Displays and filters academic queries, allowing academic staff to respond and update query status. Uses dialogs for responses and maps school IDs to names.",
  "frontend/src/pages/accounts/SchoolPaymentsPage.tsx": "Shows school payment details including outstanding amounts with edit and save capabilities. Uses query hooks to fetch and update payment data with demo-mode considerations.",
  "frontend/src/pages/admin/AdminSchoolDetailsPage.tsx": "Displays consolidated school details for admins, including metadata, outstanding amounts, packing status, visits, and queries. Handles loading, demo mode, and timestamp formatting.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Displays audit logs with search and entity-type filtering, showing results in a table with demo-mode handling.",
  "frontend/src/pages/admin/OutstandingAmountPage.tsx": "Provides school search and selection to view and update a school's outstanding amount with validation and mutation support.",
  "frontend/src/pages/admin/StaffManagementPage.tsx": "Lists staff profiles and supports creating, editing, and repairing staff records with dialogs and demo-mode restrictions.",
  "frontend/src/pages/dashboards/AcademicDashboardPage.tsx": "Shows counts of open and resolved academic queries with quick navigation to the full queries list.",
  "frontend/src/pages/dashboards/AccountsDashboardPage.tsx": "Displays total schools and provides an accounts-focused school search panel.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Aggregates system-wide metrics including schools, outstanding amounts, packing statuses, and query counts.",
  "frontend/src/pages/dashboards/MarketingDashboardPage.tsx": "Offers marketing metrics and searchable school list with outstanding amounts and packing details for selected schools.",
  "frontend/src/pages/dashboards/PackingDashboardPage.tsx": "Renders a packing dashboard showing total schools and quick navigation actions using school list data.",
  "frontend/src/pages/dashboards/TrainingDashboardPage.tsx": "Displays training overview with total schools, open/solved queries, and a school search panel.",
  "frontend/src/pages/LoginPage.tsx": "Implements login via Internet Identity or demo mode, handling authentication flows, errors, and redirects based on user role. Manages form state, clipboard copying, and UI feedback.",
  "frontend/src/pages/marketing/SchoolCreatePage.tsx": "Provides a form to create a new school and redirects based on user role after submission.",
  "frontend/src/pages/packing/packingOptions.ts": "Defines available packing class and theme options for selection components.",
  "frontend/src/pages/packing/PackingSchoolsPage.tsx": "Lists and filters schools for packing management and allows selecting a school to view details.",
  "frontend/src/pages/packing/SchoolPackingPage.tsx": "Manages packing status and counts per school, supporting class/theme selection and backend updates.",
  "frontend/src/pages/schools/SchoolDetailsPage.tsx": "Shows detailed school info with editable fields and outstanding amount status, restricted by user role.",
  "frontend/src/pages/training/SchoolTrainingPage.tsx": "Training visits page that displays school visits, supports creating/editing visits with file uploads, and allows submitting academic queries.",
  "frontend/src/pages/training/TrainingQueriesPage.tsx": "Lists all academic queries raised by the user with status, details, and optional responses.",
  "frontend/src/routeTree.tsx": "Defines the application's TanStack Router route tree, including auth checks, demo mode handling, and role‑based dashboard routing.",
  "frontend/src/utils/getErrorMessage.ts": "Utility to extract safe, user‑friendly messages from unknown error objects, including BigInt serialization handling.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters with sessionStorage support and hash‑based routing compatibility.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugin integration.",
  "project_state.json": "Metadata describing the project architecture, features, known issues, and current state for planning and maintenance."
}