{
  "backend/main.mo": "Defines the backend actor with storage and authorization mixins plus types for schools, staff, payments, packing, training, and related entities.",
  "feature_evidence.json": "Lists feature evidence records linking features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains high-level summaries of multiple frontend files for build and feature mapping.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark OKLCH color tokens and global base styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Initializes React Query, router, theming, and app-level providers.",
  "frontend/src/components/demo/DemoDataUnavailableState.tsx": "Demo-mode component that displays an alert when demo data is missing.",
  "frontend/src/components/demo/DemoPreviewBanner.tsx": "Demo-mode banner with role switching and reset-warning logic.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout with role-based navigation, demo banner, and user menu including logout.",
  "frontend/src/components/layout/RoleNav.tsx": "Renders role‑based navigation links with active state handling and optional mobile behavior.",
  "frontend/src/components/schools/SchoolSearchPanel.tsx": "Displays a searchable school list with dynamic routing actions for different department views.",
  "frontend/src/demo/demoDataStore.ts": "Implements localStorage‑backed demo data persistence for schools and other domain records with reset handling.",
  "frontend/src/demo/demoGuards.ts": "Provides demo‑mode guards to restrict mutations and identify allowed demo actions.",
  "frontend/src/demo/demoProfile.ts": "Generates synthetic user profiles for each staff role in demo mode.",
  "frontend/src/demo/demoRoutes.ts": "Maps staff roles to their corresponding dashboard routes for demo mode.",
  "frontend/src/demo/demoSession.ts": "Manages demo‑mode session state in localStorage including credentials, role, and activation flags.",
  "frontend/src/demo/useDemoPreview.ts": "React hook exposing demo‑mode state with helpers to set role and exit demo mode.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication, identity persistence, and login flow.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks and helpers for fetching and mutating user profiles, schools, payments, academic queries, and other demo or backend data.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables, dark mode styles, and custom button styling overrides.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/pages/academic/AcademicQueriesPage.tsx": "Displays academic queries with filtering and provides a dialog to respond to or update query status.",
  "frontend/src/pages/accounts/SchoolPaymentsPage.tsx": "Shows school payment details and allows viewing and editing the outstanding amount for a specific school.",
  "frontend/src/pages/admin/AdminSchoolDetailsPage.tsx": "Displays detailed school information, update history, and related consolidated data with loading and demo handling states.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Shows searchable and filterable system audit logs with demo mode restrictions and loading states.",
  "frontend/src/pages/admin/OutstandingAmountPage.tsx": "Allows admins to search schools and view/update each school's outstanding amount with validation and mutation handling.",
  "frontend/src/pages/admin/StaffManagementPage.tsx": "Provides staff listing, creation, editing, and permission repair actions with modal dialogs and demo restrictions.",
  "frontend/src/pages/dashboards/AcademicDashboardPage.tsx": "Displays counts of open and resolved academic queries with navigation to the full queries list.",
  "frontend/src/pages/dashboards/AccountsDashboardPage.tsx": "Shows total school count and provides a school search panel for financial management.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Presents overall operational metrics including schools, outstanding amounts, packing status, and academic queries.",
  "frontend/src/pages/dashboards/MarketingDashboardPage.tsx": "Displays marketing metrics including total schools, outstanding amounts, and school-specific packing details with search and selection features.",
  "frontend/src/pages/dashboards/PackingDashboardPage.tsx": "Shows packing overview with total schools and provides quick navigation to search and manage packing operations.",
  "frontend/src/pages/dashboards/TrainingDashboardPage.tsx": "Provides training metrics such as total schools and academic query counts, plus a school search panel for training workflows.",
  "frontend/src/pages/LoginPage.tsx": "Implements the login UI supporting Internet Identity and demo mode, handling redirects based on user roles and authentication state.",
  "frontend/src/pages/marketing/SchoolCreatePage.tsx": "Form page for creating a new school, submitting details via mutation and redirecting based on staff role.",
  "frontend/src/pages/packing/packingOptions.ts": "Defines selectable packing class and theme options used in the packing workflow.",
  "frontend/src/pages/packing/PackingSchoolsPage.tsx": "Lists and filters schools for packing management, allowing users to select a school to view or update packing status.",
  "frontend/src/pages/packing/SchoolPackingPage.tsx": "Manages packing status and counts for a selected school with class and theme selection, status updates, and count editing.",
  "frontend/src/pages/schools/SchoolDetailsPage.tsx": "Displays school details with editable fields for admins, loading state handling, and update mutation.",
  "frontend/src/pages/training/SchoolTrainingPage.tsx": "Manages training visits for a school, including creating, editing, uploading proof, and submitting academic queries.",
  "frontend/src/pages/training/TrainingQueriesPage.tsx": "Lists all academic queries raised by the user with loading skeletons and status badges.",
  "frontend/src/routeTree.tsx": "Defines the full TanStack Router route tree, including authentication, dashboards, and demo-mode logic.",
  "frontend/src/utils/getErrorMessage.ts": "Provides safe extraction of user-friendly error messages, handling BigInt serialization issues.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and container settings with custom plugins.",
  "project_state.json": "Defines project requirements for moving the Register School option to Admin, updating routing, and enforcing view‑only access for Marketing. Lists existing features, pending requests, and role-based authorization needs."
}