{
  "backend/main.mo": "Motoko actor defining storage mixins, authorization, and many domain types for schools, staff, payments, packing, notifications, and training.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their responsibilities across routing, modules, UI, and demo mode.",
  "frontend/index.css": "Tailwind base/theme token definitions for light and dark mode with OKLCH color variables and global styling.",
  "frontend/index.html": "Basic HTML shell mounting the React root and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app setup initializing QueryClient, router, theming, toasts, and wrapping everything in a global error boundary.",
  "frontend/src/components/demo/DemoDataUnavailableState.tsx": "Alert component showing a demo‑mode message when required demo data is missing.",
  "frontend/src/components/demo/DemoPreviewBanner.tsx": "Demo‑mode banner with role switching, reset‑warning display, and navigation/query invalidation logic.",
  "frontend/src/components/error/GlobalErrorBoundary.tsx": "Global React error boundary capturing errors, showing user‑friendly messages, and exposing raw technical details with reload options.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout handling demo mode, user profile loading, auth redirects, and rendering navigation/header with user actions.",
  "frontend/src/components/layout/RoleNav.tsx": "Role-based navigation menu component that updates links and active state based on user role and location.",
  "frontend/src/components/notifications/NotificationsBell.tsx": "Notification dropdown showing unread items, allowing marking as read, with a simplified demo mode view.",
  "frontend/src/components/schools/SchoolSearchPanel.tsx": "School search and listing panel with filtering, loading states, and role-specific action links.",
  "frontend/src/config/roleNavigation.ts": "Defines navigation items for each staff role and provides a helper to retrieve them.",
  "frontend/src/demo/demoDataStore.ts": "Manages demo-mode localStorage data for schools and related entities with safe parsing and reset handling.",
  "frontend/src/demo/demoGuards.ts": "Demo-mode guards controlling which mutation actions are allowed and providing error/tooltip helpers.",
  "frontend/src/demo/demoProfile.ts": "Generates synthetic user profiles for demo mode based on selected staff role.",
  "frontend/src/demo/demoRoutes.ts": "Maps staff roles to their demo dashboard routes and provides a helper to fetch them.",
  "frontend/src/demo/demoSession.ts": "Manages demo session state in localStorage with validation, error handling, and change events.",
  "frontend/src/demo/useDemoPreview.ts": "React hook exposing demo session state and actions using useSyncExternalStore.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data, switching to demo data when demo mode is active.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes and button overrides.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/pages/academic/AcademicPackingStatusPage.tsx": "Displays all school packing statuses with search and filtering, using packing and school data to render a table view. Shows loading skeletons and status badges.",
  "frontend/src/pages/academic/AcademicQueriesPage.tsx": "Lists academic queries and allows responding via a dialog with status updates. Loads related school and packing info and submits responses through a mutation.",
  "frontend/src/pages/accounts/AccountsQueriesPage.tsx": "Provides a read‑only view of all academic queries for the Accounts role with status badges and timestamps. Shows loading skeletons and formatted query details.",
  "frontend/src/pages/accounts/AccountsSchoolsPage.tsx": "Lets Accounts users search and browse schools, filtering by name, ID, or city. Each entry links to a school details page.",
  "frontend/src/pages/accounts/SchoolPaymentsPage.tsx": "Displays school details, packing info, and related queries for a selected school in the Accounts section. Handles loading states and navigation when a school is missing.",
  "frontend/src/pages/admin/AdminSchoolDetailsPage.tsx": "Displays detailed information for a selected school, including metadata, update history, and sectioned info, with loading and demo-mode handling.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Shows a searchable and filterable table of audit logs with loading, demo-mode, and empty‑state handling.",
  "frontend/src/pages/admin/OutstandingAmountPage.tsx": "Allows admins to search schools and view or update each school's outstanding amount, with validation and mutation feedback.",
  "frontend/src/pages/admin/StaffManagementPage.tsx": "Provides CRUD management for staff profiles, including role assignment, permission repair, and demo restrictions.",
  "frontend/src/pages/dashboards/AcademicDashboardPage.tsx": "Displays counts of open and resolved academic queries with quick navigation to the full queries list.",
  "frontend/src/pages/dashboards/AccountsDashboardPage.tsx": "Shows total schools and provides a school search interface for accounts‑related workflows.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Aggregates system-wide metrics like school count, outstanding totals, packing statuses, and academic queries, and lists school‑level stats.",
  "frontend/src/pages/dashboards/MarketingDashboardPage.tsx": "Displays marketing dashboard with school list, outstanding amounts, and packing info, allowing selecting a school for details.",
  "frontend/src/pages/dashboards/PackingDashboardPage.tsx": "Shows packing dashboard with total schools and quick navigation actions for searching schools.",
  "frontend/src/pages/dashboards/TrainingDashboardPage.tsx": "Provides training dashboard with school stats, academic query counts, and a table summarizing school packing and outstanding status.",
  "frontend/src/pages/IndexGatePage.tsx": "Gate component that routes users based on demo mode, authentication, and profile state.",
  "frontend/src/pages/LoginPage.tsx": "Implements the login page supporting Internet Identity and demo login, handling sessions, redirects, and principal copying. Includes validation, error handling, and role-based navigation.",
  "frontend/src/pages/marketing/MarketingQueriesPage.tsx": "Lists all academic queries with status, timestamps, and optional responses for marketing users.",
  "frontend/src/pages/marketing/MarketingSchoolsPage.tsx": "Offers searchable school list for marketing users with navigation to school details and registration.",
  "frontend/src/pages/marketing/SchoolCreatePage.tsx": "Form for creating a new school, submitting details and routing based on user role.",
  "frontend/src/pages/packing/PackingDispatchHistoryPage.tsx": "Displays history of dispatched packing orders with school names, counts, themes, and dates.",
  "frontend/src/pages/packing/packingOptions.ts": "Exports static packing class and theme option arrays for UI selection components.",
  "frontend/src/pages/packing/PackingQueriesPage.tsx": "Displays all academic queries for packing staff with status badges and timestamps using a list-all-queries hook.",
  "frontend/src/pages/packing/PackingSchoolsPage.tsx": "Lists all schools with search and selection for managing packing status, showing a table of filtered school data.",
  "frontend/src/pages/packing/SchoolPackingPage.tsx": "Provides detailed packing management for a specific school, including status updates and editable theme-based packing rows.",
  "frontend/src/pages/schools/SchoolDetailsPage.tsx": "Shows school details with an admin-only edit form allowing updates to core school fields.",
  "frontend/src/pages/training/SchoolTrainingPage.tsx": "Manages training visits and academic queries for a school, with create/edit dialogs and related data displays.",
  "frontend/src/pages/training/TrainingPackingDetailsPage.tsx": "Displays searchable packing status data for all schools, including kit counts, themes, and dispatch status.",
  "frontend/src/pages/training/TrainingQueriesPage.tsx": "Displays a list of academic training queries with loading skeletons, status badges, and optional responses.",
  "frontend/src/routeTree.tsx": "Defines the application's routing structure, including authenticated routes, dashboards, and demo-mode profile handling.",
  "frontend/src/utils/getErrorMessage.ts": "Provides safe extraction of user-friendly error messages, including handling React minified errors and BigInt issues.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters with hash-routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes project state and issues, including a known React #185 crash and related feature requirements."
}