{
  "backend/main.mo": "Motoko canister defining storage, authorization mixins, and all domain types such as schools, payments, staff profiles, packing, notifications, and training visits.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing routing, pages, hooks, demo mode utilities, styles, and admin features.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH color tokens, theme variables, and base styling for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring GlobalErrorBoundary, theme provider, single QueryClient instance, and TanStack Router.",
  "frontend/src/components/demo/DemoDataUnavailableState.tsx": "Alert component shown in Demo Mode when requested demo data is unavailable.",
  "frontend/src/components/demo/DemoPreviewBanner.tsx": "Demo Mode banner with role switching, corrupted-data reset warning, and query invalidation/navigation handling.",
  "frontend/src/components/error/GlobalErrorBoundary.tsx": "Global error boundary that catches rendering failures and provides a fallback UI with option to redirect to login.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout handling identity, demo mode, profile loading, redirects, and role-based navigation rendering.",
  "frontend/src/components/layout/RoleNav.tsx": "Role-specific navigation menu that updates on role changes and highlights the active route.",
  "frontend/src/components/notifications/NotificationsBell.tsx": "Notifications dropdown showing unread items with options to mark one or all as read.",
  "frontend/src/components/schools/SchoolSearchPanel.tsx": "Searchable school list with filtering, loading states, and role-based action links.",
  "frontend/src/demo/demoDataStore.ts": "LocalStorage-based demo datastore for schools, outstanding amounts, packing data, training visits, and academic queries.",
  "frontend/src/demo/demoGuards.ts": "Guards that enforce allowed actions in demo mode and block disallowed mutations.",
  "frontend/src/demo/demoProfile.ts": "Generates synthetic user profiles for each role during demo mode.",
  "frontend/src/demo/demoRoutes.ts": "Maps staff roles to their demo-mode dashboard routes.",
  "frontend/src/demo/demoSession.ts": "Manages demo session state, credentials, role selection, and persistence via localStorage.",
  "frontend/src/demo/useDemoPreview.ts": "Hook for reading and updating demo-mode state, including role switching and exit.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend or demo data, using the actor for authenticated calls.",
  "frontend/src/index.css": "Configures global Tailwind styles, CSS variables for themes, and custom button styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/academic/AcademicQueriesPage.tsx": "Lists all academic queries and provides a dialog for responding with status updates and school-related info.",
  "frontend/src/pages/accounts/SchoolPaymentsPage.tsx": "Displays school details, packing status, counts, and academic queries for a selected school.",
  "frontend/src/pages/admin/AdminSchoolDetailsPage.tsx": "Shows consolidated school details including metadata, packing info, visits, queries, and update history.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Fetches and filters audit logs with search and type filters, showing system activity entries.",
  "frontend/src/pages/admin/OutstandingAmountPage.tsx": "Allows selecting a school and viewing or updating its outstanding payment amount with validation.",
  "frontend/src/pages/admin/StaffManagementPage.tsx": "Provides UI to list, create, edit, and repair staff profiles using modal dialogs and mutation hooks.",
  "frontend/src/pages/dashboards/AcademicDashboardPage.tsx": "Displays counts of open and resolved academic queries with quick navigation to the queries page.",
  "frontend/src/pages/dashboards/AccountsDashboardPage.tsx": "Shows total registered schools and includes a school search panel for financial management.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Aggregates system-wide metrics including schools, outstanding amounts, packing status, and academic queries.",
  "frontend/src/pages/dashboards/MarketingDashboardPage.tsx": "Shows school totals, outstanding amounts, and expandable school details with packing and outstanding info.",
  "frontend/src/pages/dashboards/PackingDashboardPage.tsx": "Provides packing overview with school count and quick navigation to packing-related actions.",
  "frontend/src/pages/dashboards/TrainingDashboardPage.tsx": "Displays training-related metrics including school totals, open/solved queries, and a school status table.",
  "frontend/src/pages/IndexGatePage.tsx": "Redirects users to login or role-based dashboards based on identity, demo mode, and profile state.",
  "frontend/src/pages/LoginPage.tsx": "Implements login via Internet Identity or demo credentials, handling redirects, errors, and UI states.",
  "frontend/src/pages/marketing/SchoolCreatePage.tsx": "Form page for creating a new school, submitting details via mutation and navigating based on user role.",
  "frontend/src/pages/packing/packingOptions.ts": "Exports constant packing class and theme option lists.",
  "frontend/src/pages/packing/PackingSchoolsPage.tsx": "Lists all schools with search and selection to navigate to packing management for a specific school.",
  "frontend/src/pages/packing/SchoolPackingPage.tsx": "Displays and updates a school's packing status and per-theme/class packing counts.",
  "frontend/src/pages/schools/SchoolDetailsPage.tsx": "Shows school details with admin‑only editing to update school information.",
  "frontend/src/pages/training/SchoolTrainingPage.tsx": "Manages training visits, academic queries, and displays related school, packing, and outstanding data.",
  "frontend/src/pages/training/TrainingQueriesPage.tsx": "Displays all academic queries raised by the user with loading and status badges.",
  "frontend/src/routeTree.tsx": "Defines the app’s TanStack Router structure, including login, authenticated layout, demo-mode handling, and role-based dashboard/feature routes.",
  "frontend/src/utils/getErrorMessage.ts": "Provides a safe extractor for readable error messages, with special handling for BigInt serialization failures.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, themes, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Tracks project state, known issues, and feature requirements related to fixing blank-screen routing and auth behavior."
}