{
  "backend/main.mo": "Actor defining types and mixins for storage, authorization, and domain models like schools, staff, payments, packing, and training visits.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend pages, hooks, and components involved in routing, data handling, and UI features.",
  "frontend/index.css": "Global Tailwind-based CSS defining light and dark theme design tokens using OKLCH color values.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Initializes React Query, sets up the router, and wraps the app in theme and toast providers.",
  "frontend/src/components/demo/DemoDataUnavailableState.tsx": "Alert component showing a demo-mode message when demo data is missing.",
  "frontend/src/components/demo/DemoPreviewBanner.tsx": "Demo-mode banner with a role switcher that updates session state and reroutes accordingly.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout handling identity/demo session, navigation, header UI, and logout logic.",
  "frontend/src/components/layout/RoleNav.tsx": "Role‑based navigation sidebar rendering different menu items per staff role with active route highlighting.",
  "frontend/src/components/schools/SchoolSearchPanel.tsx": "Search panel listing schools with filtering and action links based on view mode.",
  "frontend/src/demo/demoDataStore.ts": "LocalStorage-backed demo data store for schools, outstanding amounts, and packing info with conversion helpers.",
  "frontend/src/demo/demoGuards.ts": "Provides helpers to disable mutations and show messages when demo mode is active.",
  "frontend/src/demo/demoProfile.ts": "Generates synthetic user profiles for each staff role during demo mode.",
  "frontend/src/demo/demoRoutes.ts": "Maps staff roles to their corresponding dashboard routes in demo mode.",
  "frontend/src/demo/demoSession.ts": "Handles demo session state, credentials, persistence, and role access in localStorage.",
  "frontend/src/demo/useDemoPreview.ts": "Hook for reading and updating demo-mode session state and role selection.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity login, stored identities, and status.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, schools, and demo fallbacks, integrating with the backend actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/academic/AcademicQueriesPage.tsx": "Lists academic queries with filtering and allows responding via a dialog form.",
  "frontend/src/pages/accounts/SchoolPaymentsPage.tsx": "Manages school payments, supporting creation, editing, proof uploads, and handling demo mode restrictions.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Displays and filters audit logs with search and type filtering, including demo mode handling.",
  "frontend/src/pages/admin/OutstandingAmountPage.tsx": "Allows admins to search schools and update each school's outstanding amount.",
  "frontend/src/pages/admin/StaffManagementPage.tsx": "Provides UI to list, create, edit, and repair staff profiles with form dialogs and mutation handling. Includes demo-mode guards and toast notifications.",
  "frontend/src/pages/dashboards/AcademicDashboardPage.tsx": "Displays counts of open and resolved academic queries with summary cards and a link to view all queries.",
  "frontend/src/pages/dashboards/AccountsDashboardPage.tsx": "Shows total schools and provides a school search panel for accounts-related operations.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Admin dashboard summarizing total schools, staff, and audit logs, plus recent activity and navigation actions.",
  "frontend/src/pages/dashboards/MarketingDashboardPage.tsx": "Marketing dashboard showing total schools and offering school registration and search tools.",
  "frontend/src/pages/dashboards/PackingDashboardPage.tsx": "Packing dashboard showing school count and quick actions to search and manage packing tasks.",
  "frontend/src/pages/dashboards/TrainingDashboardPage.tsx": "Training dashboard summarizing total schools and open academic queries, with a school search panel.",
  "frontend/src/pages/LoginPage.tsx": "Implements login UI with Internet Identity and demo mode, handling authentication flow and redirects.",
  "frontend/src/pages/marketing/SchoolCreatePage.tsx": "Form page for creating a new school, submitting details via mutation and redirecting based on user role.",
  "frontend/src/pages/packing/packingOptions.ts": "Defines available packing class and theme option constants for the UI.",
  "frontend/src/pages/packing/PackingSchoolsPage.tsx": "Displays a searchable list of schools for packing management and navigates to each school’s packing page.",
  "frontend/src/pages/packing/SchoolPackingPage.tsx": "Manages packing status and counts for a selected school with class/theme filters and update actions.",
  "frontend/src/pages/schools/SchoolDetailsPage.tsx": "Shows school details with editable fields and displays outstanding financial information.",
  "frontend/src/pages/training/SchoolTrainingPage.tsx": "Lists and creates training visit logs for a specific school, including file upload for proof.",
  "frontend/src/pages/training/TrainingQueriesPage.tsx": "Displays all academic queries raised by the user, with statuses and responses.",
  "frontend/src/routeTree.tsx": "Defines application routing, authentication handling, and dashboard redirects based on user roles.",
  "frontend/src/utils/getErrorMessage.ts": "Provides a safe extractor for user-facing error messages, with special handling for BigInt serialization errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL and sessionStorage parameters and persisting them across navigation, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing the app’s architecture, RBAC rules, known issues, and existing feature records for internal planning."
}