{
  "backend/main.mo": "Motoko actor defining storage, authorization mixins, and many domain types such as School, Payment, Packing, TrainingVisit, and staff roles.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short functional descriptions for build planning.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, dark mode variants, and global element styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Initializes QueryClient and router, wraps the app in theming, query, and global error boundary providers.",
  "frontend/src/components/demo/DemoDataUnavailableState.tsx": "Alert component showing a demo‑mode message when data is unavailable.",
  "frontend/src/components/demo/DemoPreviewBanner.tsx": "Demo‑mode banner enabling role switching and showing data‑reset warnings with navigation and query invalidation.",
  "frontend/src/components/error/GlobalErrorBoundary.tsx": "React error boundary that catches app-wide errors and displays a detailed fallback UI with optional technical info.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout handling authentication/demo redirects, user profile loading, role-based navigation, and logout.",
  "frontend/src/components/layout/RoleNav.tsx": "Role-based navigation menu that updates links and highlights the active route, supporting mobile mode.",
  "frontend/src/components/notifications/NotificationsBell.tsx": "Notifications dropdown showing unread items, allowing marking as read, with a simplified demo-mode view.",
  "frontend/src/components/schools/SchoolSearchPanel.tsx": "School search and listing panel with filtering and role-specific action links, showing loading and empty states.",
  "frontend/src/demo/demoDataStore.ts": "LocalStorage-backed demo data store for schools and related entities, with conversion helpers and corruption recovery.",
  "frontend/src/demo/demoGuards.ts": "Utility guards controlling which actions are allowed in demo mode and providing error messages for blocked mutations.",
  "frontend/src/demo/demoProfile.ts": "Generates synthetic UserProfile objects for each StaffRole for demo mode without backend calls.",
  "frontend/src/demo/demoRoutes.ts": "Maps each StaffRole to its dashboard route and provides a helper to fetch the route.",
  "frontend/src/demo/demoSession.ts": "Manages demo-mode session state in localStorage with credential validation and change events.",
  "frontend/src/demo/useDemoPreview.ts": "React hook exposing demo-mode state with reactive updates and helpers to set or clear demo sessions.",
  "frontend/src/hooks/useActor.ts": "Creates and tracks the backend actor based on identity and refreshes dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user, staff, and module operations with demo-mode fallbacks and actor integration.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes plus global button overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/academic/AcademicQueriesPage.tsx": "Displays all academic queries and allows responding with status updates, showing related school and packing info for selected items. Includes a dialog for submitting responses with mutation handling.",
  "frontend/src/pages/accounts/SchoolPaymentsPage.tsx": "Shows school details, packing status, and academic queries for a selected school, with loading states and navigation controls. Provides read‑only views of packing and school metadata.",
  "frontend/src/pages/admin/AdminSchoolDetailsPage.tsx": "Loads and displays consolidated school details including metadata, packing, training, and academic info, with special handling for demo mode. Includes section‑level update timestamps and navigation UI.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Lists all audit logs with search and filtering by entity type, showing timestamps and log details. Handles loading, demo‑mode restrictions, and empty or filtered results.",
  "frontend/src/pages/admin/OutstandingAmountPage.tsx": "Provides UI to search schools, view current outstanding amounts, and update a selected school’s outstanding value.",
  "frontend/src/pages/admin/StaffManagementPage.tsx": "Displays staff list and supports creating, editing, and repairing staff profiles through dialogs and form submissions.",
  "frontend/src/pages/dashboards/AcademicDashboardPage.tsx": "Shows counts of open and resolved academic queries with quick navigation to the full queries list.",
  "frontend/src/pages/dashboards/AccountsDashboardPage.tsx": "Displays total schools and includes a school search panel for managing financial records.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Aggregates system-wide metrics like schools, outstanding amounts, packing status, and query counts for an admin overview.",
  "frontend/src/pages/dashboards/MarketingDashboardPage.tsx": "Shows marketing-related metrics and a selectable school list with outstanding amounts and packing summaries.",
  "frontend/src/pages/dashboards/PackingDashboardPage.tsx": "Provides packing operations overview with total schools and quick navigation to school search for packing tasks.",
  "frontend/src/pages/dashboards/TrainingDashboardPage.tsx": "Displays training dashboard with summary cards and a schools overview table using multiple query hooks.",
  "frontend/src/pages/IndexGatePage.tsx": "Gate page that routes users or demo sessions to the correct dashboard after identity/profile checks.",
  "frontend/src/pages/LoginPage.tsx": "Implements login via Internet Identity or demo credentials, handling session state, errors, and role-based navigation. Also supports copying principal IDs and auto-redirecting active demo sessions.",
  "frontend/src/pages/marketing/SchoolCreatePage.tsx": "Provides a form to create a new school and submit details via mutation, with navigation based on user role.",
  "frontend/src/pages/packing/packingOptions.ts": "Exports constant lists of packing classes and themes for selection components.",
  "frontend/src/pages/packing/PackingSchoolsPage.tsx": "Lists schools with search and selection to navigate to individual packing pages.",
  "frontend/src/pages/packing/SchoolPackingPage.tsx": "Allows viewing and updating packing status and theme-based packing counts for a specific school.",
  "frontend/src/pages/schools/SchoolDetailsPage.tsx": "Shows school details with editable form for admins and saves updates via mutation.",
  "frontend/src/pages/training/SchoolTrainingPage.tsx": "Manages school training visits and academic queries, including listing, creating, and editing visits with dialog forms. Fetches related school data such as outstanding amounts and packing status.",
  "frontend/src/pages/training/TrainingQueriesPage.tsx": "Displays a list of academic queries with status badges and optional responses, showing skeleton loaders while fetching.",
  "frontend/src/routeTree.tsx": "Defines the application's route structure using TanStack Router, including authentication handling, dashboards, and feature-specific pages.",
  "frontend/src/utils/getErrorMessage.ts": "Provides a safe utility for extracting user-friendly error messages, handling BigInt issues and common React runtime errors.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s current state, including a regression causing runtime errors and required fixes, with enumerated features and known issues. Acts as a planning artifact for restoring a working build and addressing hook misuse and redirect loops."
}