{
  "backend/main.mo": "Defines the actor with storage and authorization mixins plus all domain types for schools, staff, payments, packing, training, and outstanding amounts.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark design tokens and global styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up QueryClient, router, theme provider, and global Toaster for the React app.",
  "frontend/src/components/demo/DemoDataUnavailableState.tsx": "Renders an alert shown when demo mode lacks required data.",
  "frontend/src/components/demo/DemoPreviewBanner.tsx": "Displays a demo-mode banner with a role switcher that triggers navigation and query invalidation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout handling identity, demo mode, header, navigation, and logout logic.",
  "frontend/src/components/layout/RoleNav.tsx": "Role-based navigation menu rendering links and icons with active-state styling, updating when the user role changes.",
  "frontend/src/components/schools/SchoolSearchPanel.tsx": "Searchable school list panel with filtering, loading skeletons, and context-specific action links.",
  "frontend/src/demo/demoDataStore.ts": "LocalStorage-backed demo data store handling schools, outstanding amounts, and packing status with bigint serialization.",
  "frontend/src/demo/demoGuards.ts": "Utility functions to disable mutations and provide messages when demo mode is active.",
  "frontend/src/demo/demoProfile.ts": "Generates synthetic user profiles per staff role for demo mode without backend calls.",
  "frontend/src/demo/demoRoutes.ts": "Maps staff roles to their dashboard routes and exposes a helper to retrieve them.",
  "frontend/src/demo/demoSession.ts": "Manages demo mode sessions in localStorage, including credentials, activation, and role persistence.",
  "frontend/src/demo/useDemoPreview.ts": "Hook exposing demo mode state and providing methods to set roles or exit demo mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout helpers, and identity persistence using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, schools, payments, and other backend data with demo-mode fallbacks.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/academic/AcademicQueriesPage.tsx": "Displays academic queries with filtering and provides a dialog to submit responses.",
  "frontend/src/pages/accounts/SchoolPaymentsPage.tsx": "Manages school payment records, including creation, editing, and uploading payment proofs.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Shows filterable audit logs, with demo-mode handling and search functionality.",
  "frontend/src/pages/admin/OutstandingAmountPage.tsx": "Provides UI to search schools, view current outstanding amount, and update it using related queries and mutations.",
  "frontend/src/pages/admin/StaffManagementPage.tsx": "Manages staff profiles including listing, creating, editing, and repairing permissions with dialogs and form handling.",
  "frontend/src/pages/dashboards/AcademicDashboardPage.tsx": "Displays counts of open and resolved academic queries with navigation to the full queries list.",
  "frontend/src/pages/dashboards/AccountsDashboardPage.tsx": "Shows total schools and provides a school search panel for accounts-related operations.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Admin overview showing totals for schools, staff, and activities plus recent audit logs and quick navigation actions.",
  "frontend/src/pages/dashboards/MarketingDashboardPage.tsx": "Displays total schools and provides tools for searching and registering schools for marketing workflows.",
  "frontend/src/pages/dashboards/PackingDashboardPage.tsx": "Shows total schools and offers navigation for searching schools and managing packing operations.",
  "frontend/src/pages/dashboards/TrainingDashboardPage.tsx": "Summarizes total schools and open academic queries and includes a school search panel tailored for training tasks.",
  "frontend/src/pages/LoginPage.tsx": "Implements login flow for Internet Identity and demo mode, including redirects based on user role.",
  "frontend/src/pages/marketing/SchoolCreatePage.tsx": "Form page to register a new school and navigate based on user role after creation.",
  "frontend/src/pages/packing/packingOptions.ts": "Defines available packing classes and themes as constant option lists.",
  "frontend/src/pages/packing/PackingSchoolsPage.tsx": "Lists all schools with search and lets users select one to manage packing.",
  "frontend/src/pages/packing/SchoolPackingPage.tsx": "Manages packing status and counts for a specific school, including class/theme selection.",
  "frontend/src/pages/schools/SchoolDetailsPage.tsx": "Displays and allows editing of a school’s details with outstanding amount info.",
  "frontend/src/pages/training/SchoolTrainingPage.tsx": "Logs and displays training visits for a school, including file upload for proof.",
  "frontend/src/pages/training/TrainingQueriesPage.tsx": "Shows all academic queries raised by the user with status and responses.",
  "frontend/src/routeTree.tsx": "Defines the application's route structure with authentication, demo-mode handling, and role-based redirects to various dashboards and pages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters, including sessionStorage-backed values and hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS themes, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project's architecture, requirements, current issues, and feature set for a role-based internal school management app."
}