{
  "backend/main.mo": "Defines backend actor with storage mixins, authorization, and data types for schools, staff, payments, packing, training, academic queries, and audit logs.",
  "feature_evidence.json": "Lists implemented features with linked files, components, tests, and confidence levels for audit and traceability.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files used for route handling, pages, hooks, and styles.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color tokens, themes, and base UI variables.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Initializes React Query and TanStack Router, wraps app with ThemeProvider and Toaster.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with header, role-based sidebar, logout handling, and outlet rendering.",
  "frontend/src/components/layout/RoleNav.tsx": "Renders role-specific navigation links based on staff role with mobile and desktop variants.",
  "frontend/src/components/schools/SchoolSearchPanel.tsx": "Searchable school list component with filters and context-specific navigation actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login flow and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data using the actor, covering profiles, staff, schools, and other modules.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and applying base styles.",
  "frontend/src/main.tsx": "Bootstraps the app with React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/academic/AcademicQueriesPage.tsx": "Displays academic queries with filtering and provides a dialog to respond and update query status.",
  "frontend/src/pages/accounts/SchoolPaymentsPage.tsx": "Manages school payments, including listing, creating, editing, and uploading PDF proofs. Uses dialogs, tables, and queries to handle payment data and file uploads.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Displays and filters audit logs with search and entity-type filtering. Renders logs in a table with loading states.",
  "frontend/src/pages/admin/StaffManagementPage.tsx": "Lists staff profiles and provides dialogs to create or update staff information. Integrates form handling, validation, and backend mutations.",
  "frontend/src/pages/dashboards/AcademicDashboardPage.tsx": "Shows counts of open and resolved academic queries with summary cards. Provides navigation to the full queries list.",
  "frontend/src/pages/dashboards/AccountsDashboardPage.tsx": "Displays total school count and provides a school search panel for accounts tasks. Fetches school data and shows a summary card.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Shows totals for schools, staff, and audit logs plus a recent activity list. Uses summary cards and recent log preview.",
  "frontend/src/pages/dashboards/MarketingDashboardPage.tsx": "Shows total schools and includes tools for school registration and search. Provides marketing-focused navigation and summary.",
  "frontend/src/pages/dashboards/PackingDashboardPage.tsx": "Displays packing status metrics like pending dispatch and total schools. Includes a search panel tailored for packing operations.",
  "frontend/src/pages/dashboards/TrainingDashboardPage.tsx": "Displays training dashboard with counts of schools and open academic queries plus a school search panel.",
  "frontend/src/pages/LoginPage.tsx": "Implements the login screen using Internet Identity and redirects users based on role and profile status.",
  "frontend/src/pages/marketing/SchoolCreatePage.tsx": "Provides a form to create a new school and submit it via mutation with validation and success/error toasts.",
  "frontend/src/pages/packing/SchoolPackingPage.tsx": "Loads a school’s packing status, allows editing kit/add-on counts and dispatch info, and updates via mutation.",
  "frontend/src/pages/schools/SchoolDetailsPage.tsx": "Shows school details with editable fields for authorized roles and updates the school via mutation.",
  "frontend/src/pages/training/SchoolTrainingPage.tsx": "Manages training visits and academic queries for a school, including file upload for visit proofs.",
  "frontend/src/pages/training/TrainingQueriesPage.tsx": "Lists all academic queries raised by the user with status badges and optional responses.",
  "frontend/src/routeTree.tsx": "Defines all application routes, including login, authenticated layout, role-based redirects, and department-specific dashboard and school pages using TanStack Router.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning sensitive params from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, plugins, and container settings for the frontend UI theme.",
  "project_state.json": "Describes the project's current state, including architecture notes, RBAC-driven features, and requirements for the multi-department school management system."
}