{
  "kind": "build_request",
  "title": "Light-mode white backgrounds for Demo role switcher dropdown and Training Visit form",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-58",
      "text": "Update the Demo/Preview Mode role switcher dropdown in the top banner so its trigger and opened dropdown surface render with a solid white background in light mode, while preserving existing styling behavior in dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make switching role drop down background color is white.",
          "yes imean Demo/Preview Mode role switcher in the top banner",
          "Should these background changes apply only in light mode"
        ]
      },
      "acceptanceCriteria": [
        "When Demo/Preview Mode is active, the role switcher SelectTrigger in the top banner renders with a solid white background in light mode.",
        "When the role switcher dropdown is opened, the dropdown content surface renders with a solid white background in light mode (no transparency).",
        "In dark mode, the role switcher retains the existing dark-mode look and remains readable (do not force a white background in dark mode).",
        "No changes to role-switching behavior: selecting a role still updates the demo role and navigates to the correct dashboard route."
      ]
    },
    {
      "id": "REQ-59",
      "text": "Update the Training module Training Visit create/edit form container to have a solid white background in light mode (entire form container), while preserving existing styling behavior in dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Edit Training visit Form background color white",
          "For “Training visit form background color white”, do you want the entire form container to be white",
          "Should these background changes apply only in light mode"
        ]
      },
      "acceptanceCriteria": [
        "On the Training Visits page, opening the Log Visit dialog shows the entire form container with a solid white background in light mode (no transparency).",
        "On the Training Visits page, opening the Edit Training Visit dialog shows the entire form container with a solid white background in light mode (no transparency).",
        "In dark mode, the dialog keeps the existing dark-mode background tokens and remains readable (do not force a white background in dark mode).",
        "Opening and closing the dialog, saving, and canceling do not produce runtime errors and do not break Demo/Preview Mode behavior."
      ]
    }
  ],
  "constraints": [
    "Frontend changes must be limited to the relevant components/pages and must not introduce global background color changes across the app.",
    "Apply the requested white background changes only in light mode; preserve existing dark-mode styling.",
    "Do not modify any files under the immutable UI components directory (frontend/src/components/ui)."
  ],
  "nonGoals": [
    "No backend/canister changes.",
    "No redesign of the Demo/Preview banner or Training page layout beyond the requested background color adjustments.",
    "No changes to authentication, route guarding, or demo-session logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}