{
  "kind": "build_request",
  "title": "Fix BigInt serialization error during school registration",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "Fix Demo/Preview Mode localStorage persistence for School records so registering a school does not throw \"Do not know how to serialize a BigInt\" when saving to localStorage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "if i register school i got this error (Do not know how to serialize a BigInt)"
        ]
      },
      "acceptanceCriteria": [
        "In Demo/Preview Mode, submitting the Register New School form successfully creates the school without any runtime errors.",
        "Schools saved in Demo/Preview Mode are persisted across reloads (localStorage) and can be listed/selected on pages that use the school list.",
        "All bigint fields in a School object (e.g., studentCount, createdTimestamp, lastUpdateTimestamp) are stored in localStorage in a JSON-compatible way (e.g., as strings) and converted back to bigint when reading.",
        "Existing demo schools already stored in localStorage (if any) do not cause the app to crash; parsing should be backward-tolerant (e.g., handle numbers/strings and convert to bigint)."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Ensure user-facing error handling for school registration never attempts to JSON-serialize raw objects containing bigint values; show a clear English error message when school registration fails.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "if i register school i got this error (Do not know how to serialize a BigInt)"
        ]
      },
      "acceptanceCriteria": [
        "If school registration fails (demo or non-demo), the UI shows an English toast message that does not include \"Do not know how to serialize a BigInt\".",
        "The Register New School page remains usable after a failure (no blank screen, no unhandled promise rejection).",
        "If an error message is displayed from an exception, it is extracted safely as a string (without JSON.stringify on unknown objects)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only and must be composed).",
    "Do not modify immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration code if a state schema upgrade is required (this change should be frontend-only)."
  ],
  "nonGoals": [
    "Changing the backend School type (studentCount as Nat) or backend school creation logic.",
    "Adding new demo features beyond fixing demo school persistence and error handling for registration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}