{
  "kind": "build_request",
  "title": "Fix Admin initial-load crash (Minified React error #185)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Identify and fix the root cause of the initial-load crash on the Admin page that triggers “Minified React error #185” (invalid hook call), so the app renders the Admin dashboard successfully on first load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Still this error (Minified React error #185; visit https://react.dev/errors/185 for the full message or use the non-minified dev environment for full errors and additional helpful warnings.)",
          "admin page",
          "build the fix"
        ]
      },
      "acceptanceCriteria": [
        "Opening the app when the Admin page is the first route no longer shows the GlobalErrorBoundary screen.",
        "No “Minified React error #185” appears in the UI or browser console during initial load.",
        "All React hooks used by the Admin initial render path are invoked only inside valid React function components or custom hooks (no hooks executed at module scope, inside non-component functions, or conditionally in a way that violates the Rules of Hooks)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve crash diagnosability for future issues by ensuring the GlobalErrorBoundary’s “Technical Details” section provides actionable information for React #185 cases (e.g., include the raw error message and component stack without causing secondary errors), while keeping user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "i cant see anything from your out.",
          "solve this error"
        ]
      },
      "acceptanceCriteria": [
        "When an error occurs, the error boundary still renders without throwing additional errors.",
        "Clicking “Technical Details” reveals the component stack (when available) and does not break the page.",
        "User-facing error boundary strings remain in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not edit files in frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Adding new product features or changing role-based permissions/authorization logic beyond what is required to stop the crash.",
    "Backend schema changes or data migrations unless proven necessary to resolve the React crash."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}