{
  "kind": "build_request",
  "title": "Fix blank white screen by correcting routing/auth gating and QueryClient usage",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Eliminate the blank white screen on the deployed site by ensuring the app always renders a visible UI state (login screen, loading state, or error state) at route \"/\" and protected routes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-blank-1"
        ],
        "quotes": [
          "i cant view the site, it looks blank white",
          "there isno any loading spinner"
        ]
      },
      "acceptanceCriteria": [
        "Opening the deployed app at \"/\" shows either the Login page or a loading indicator within 1 second; it must not remain a blank white screen.",
        "If the user is not authenticated and demo mode is not active, navigating to any protected route (e.g. \"/admin/dashboard\") reliably redirects to \"/login\" (or displays a clear unauthenticated screen) instead of rendering nothing.",
        "If demo mode is active, the app navigates to the correct demo dashboard route and renders the layout/content (not blank)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Refactor route-level authentication logic in frontend/src/routeTree.tsx to avoid fetching the caller profile via React Query during route beforeLoad (remove reliance on getCallerUserProfileQuery/ensureQueryData there), and instead perform only demo-session routing decisions in beforeLoad; perform non-demo auth/profile checks in UI components where hooks are valid.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-blank-1"
        ],
        "quotes": [
          "i want to see working demo version now"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/routeTree.tsx no longer calls queryClient.ensureQueryData(getCallerUserProfileQuery()) in beforeLoad for \"/\" and the authenticated route gate.",
        "When not in demo mode, visiting \"/\" results in a deterministic UI path (loading -> redirect/login) without route-load deadlocks.",
        "Demo mode routing at \"/\" still redirects to the demo dashboard returned by getDashboardRoute(getDemoRole())."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update frontend/src/components/layout/AppLayout.tsx so that when profile is missing (and demo mode is not active), it renders a safe fallback that navigates to \"/login\" (and/or shows an inline message) rather than returning null.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-blank-1"
        ],
        "quotes": [
          "i cant view the site, it looks blank white"
        ]
      },
      "acceptanceCriteria": [
        "If profileLoading is false and profile is null/undefined while not in demo mode, AppLayout triggers navigation to \"/login\" and shows a minimal loading/fallback view until navigation completes.",
        "The authenticated layout never returns null in a way that results in a blank page."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Use a single React Query QueryClient instance consistently for both the React Query provider and the TanStack Router context (avoid creating multiple QueryClient instances across frontend/src/main.tsx and frontend/src/App.tsx).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-blank-1"
        ],
        "quotes": [
          "i cant view the site, it looks blank white"
        ]
      },
      "acceptanceCriteria": [
        "There is exactly one QueryClient instance created for the app runtime and it is used by both <QueryClientProvider> and the router context.",
        "After the change, navigation and data fetching (including demo mode) works without a blank screen regression."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a simple global client-side error fallback so that unexpected render/runtime errors show a user-visible error panel with a \"Go to Login\" action instead of a blank white screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-blank-1"
        ],
        "quotes": [
          "i want to see working demo version now"
        ]
      },
      "acceptanceCriteria": [
        "If an uncaught error happens during initial render, the app displays an error view with readable text in English and a button/link that navigates to \"/login\".",
        "The error fallback is styled consistently with the existing Tailwind/Shadcn UI components."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts (or .tsx), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (immutable paths).",
    "Keep the backend single-actor architecture; no additional canisters/services.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing new product features beyond fixing the blank-screen/deployment usability issue.",
    "Adding third-party authentication providers (only Internet Identity and existing demo mode).",
    "Adding external databases or non-IC backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}