{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix BigInt localStorage serialization in demo school registration",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Make Demo/Preview Mode School localStorage persistence JSON-compatible by encoding bigint fields on write and restoring them on read with backward-tolerant parsing.",
      "acceptanceCriteria": [
        "In Demo/Preview Mode, submitting the Register New School form successfully creates the school without any runtime errors.",
        "Schools saved in Demo/Preview Mode are persisted across reloads (localStorage) and can be listed/selected on pages that use the school list.",
        "All bigint fields in a School object (e.g., studentCount, createdTimestamp, lastUpdateTimestamp) are stored in localStorage in a JSON-compatible way (e.g., as strings) and converted back to bigint when reading.",
        "Existing demo schools already stored in localStorage (if any) do not cause the app to crash; parsing should be backward-tolerant (e.g., handle numbers/strings and convert to bigint)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/demo/demoDataStore.ts",
          "operation": "modify",
          "description": "Update Demo/Preview Mode school persistence to avoid JSON.stringify(BigInt) failures by serializing School bigint fields (studentCount, createdTimestamp, lastUpdateTimestamp) as strings when writing, and converting them back to bigint when reading. Make parsing backward-tolerant for pre-existing records by accepting bigint-like strings, numbers, or missing values without crashing, defaulting safely where needed."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure demo-mode school listing and retrieval continue to return School objects with bigint-typed fields coming from demoDataStore after the serialization changes (no runtime errors; compatible with UI usages such as Number(school.studentCount))."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Ensure school registration error handling shows a clear English message and never JSON-serializes unknown error objects that may contain bigint values.",
      "acceptanceCriteria": [
        "If school registration fails (demo or non-demo), the UI shows an English toast message that does not include \"Do not know how to serialize a BigInt\".",
        "The Register New School page remains usable after a failure (no blank screen, no unhandled promise rejection).",
        "If an error message is displayed from an exception, it is extracted safely as a string (without JSON.stringify on unknown objects)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/getErrorMessage.ts",
          "operation": "create",
          "description": "Add a small utility to safely convert unknown thrown values into a user-friendly English message without using JSON.stringify on unknown objects (to avoid BigInt serialization). Include special-casing so messages containing \"Do not know how to serialize a BigInt\" are replaced with a clear generic failure message."
        },
        {
          "path": "frontend/src/pages/marketing/SchoolCreatePage.tsx",
          "operation": "modify",
          "description": "Use the new safe error-message utility for the registration submit catch path. Ensure the toast message is always clear English and never surfaces \"Do not know how to serialize a BigInt\"; keep the page interactive after failures (no rethrow / no unhandled promise rejection)."
        }
      ]
    }
  ]
}