{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Move Register School to Admin navigation and make Marketing school details view-only",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Move the “Register School” navigation item from Marketing to Admin in both header and any role-based sidebar nav.",
      "acceptanceCriteria": [
        "When logged in as Admin, the header navigation includes a “Register School” item that navigates to the school registration form.",
        "When logged in as Marketing, no “Register School” item is present in the header navigation.",
        "When logged in as Marketing, no “Register School” item is present in the role-based sidebar navigation (if used)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Update the role-based header navigation so Admin includes “Register School” (pointing to the new admin route) and Marketing no longer includes it. Use the authorization component’s role-based access concept (via the fetched user profile role) to drive which items render. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/RoleNav.tsx",
          "operation": "modify",
          "description": "Update role-based sidebar navigation items so Admin includes “Register School” (pointing to the new admin route) and Marketing no longer includes it. Use the authorization component’s role-based access concept (via staff role) to determine visibility. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Move the school registration route under an Admin path and prevent Marketing from accessing it, redirecting old Marketing URLs to the Marketing dashboard.",
      "acceptanceCriteria": [
        "Admin users can open the registration form from the Admin navigation and successfully reach the registration page.",
        "Marketing users cannot reach the registration form via direct URL to the previous Marketing registration route; they are redirected to the Marketing dashboard (or another authorized page).",
        "No broken links remain in the Marketing UI after removing the register option."
      ],
      "file_operations": [
        {
          "path": "frontend/src/routeTree.tsx",
          "operation": "modify",
          "description": "Register a new admin-only route for the school registration page under /admin/... and add a guard that redirects non-admin (including Marketing) to an authorized page (e.g., Marketing dashboard). Also keep the previous /marketing/... registration path as a redirect route that sends Marketing to their dashboard and Admin to the new admin registration route. Use the authorization component’s role-based access concept (profile role) for the route guards. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/marketing/SchoolCreatePage.tsx",
          "operation": "modify",
          "description": "Ensure the registration page behavior aligns with admin-only routing: update any internal navigation (e.g., post-submit and cancel flows) to route users to appropriate admin pages when accessed via the new /admin/... route, and avoid assumptions that this page is Marketing-only. Use the authorization component’s role-based access concept (caller profile role) to decide safe navigation targets. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make Marketing view-only on the School Details page by removing Edit actions and keeping fields read-only for Marketing.",
      "acceptanceCriteria": [
        "When logged in as Marketing and viewing a school’s details, there is no visible “Edit” button and no edit/save/cancel controls are available.",
        "When logged in as Marketing, all school detail inputs remain disabled/read-only.",
        "When logged in as Admin, the existing edit workflow on the School Details page continues to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/schools/SchoolDetailsPage.tsx",
          "operation": "modify",
          "description": "Update role checks so only Admin can enter edit mode and see Edit/Save/Cancel controls; Marketing must always remain in view-only mode with inputs disabled. Use the authorization component’s role-based access concept (caller profile role) to control edit capability. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}