{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "School search-driven Packing updates, outstanding amount editor, and fully functional Demo/Preview mode persistence",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Update Packing UI to allow searching/selecting a school, show selected school details read-only, and edit packing status for the selected school with a clear empty state when none is selected.",
      "acceptanceCriteria": [
        "Packing page provides a school search/select control (searchable list) and selecting a school navigates/loads the packing editor for that school.",
        "Selected school details (name, address, city/state, contact info, student count) are visible and non-editable on the Packing page.",
        "If no school is selected, the Packing page shows a clear empty state prompting the user to search and select a school.",
        "All user-facing labels/messages are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/packing/PackingSchoolsPage.tsx",
          "operation": "create",
          "description": "Create a Packing landing page that shows a school search/select UI and an English empty state when no school is selected; selecting a school navigates to the existing per-school Packing editor. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/packing/SchoolPackingPage.tsx",
          "operation": "modify",
          "description": "Enhance the per-school Packing editor to display the selected school’s details in a read-only section (name, address, city/state, contact info, student count) above the editable packing controls; ensure all labels/messages are in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/schools/SchoolSearchPanel.tsx",
          "operation": "modify",
          "description": "Extend the searchable schools list to support a 'select' mode (e.g., callback on row/action click) so Packing school selection can be performed in-page without relying solely on pre-existing route params. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/routeTree.tsx",
          "operation": "modify",
          "description": "Wire the new Packing school-select page into routing (e.g., /packing/schools) and ensure navigation flows from Packing module to the select page and then to the per-school editor. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Add Class and Theme dropdowns to Packing status editing with the exact requested option sets, and ensure values are saved and reloaded per school (including demo-mode persistence).",
      "acceptanceCriteria": [
        "Packing page shows a Class dropdown with options exactly: Beginner, Explorer, Master.",
        "Packing page shows a Theme dropdown with options exactly: MYSELF, SHAPES, ANIMAL KINGDOM, PLANT TREES AND FLOWERS, FRUITS AND VEGETABLES, FIVE ELEMENTS.",
        "Saving packing status persists class + theme for the school and they are correctly displayed when revisiting the same school.",
        "Backend enforces that only Packing role (or Admin) can update packing status, consistent with existing RBAC behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/packing/SchoolPackingPage.tsx",
          "operation": "modify",
          "description": "Replace/augment the current free-text theme input with two dropdowns: Class (Beginner/Explorer/Master) and Theme (MYSELF/SHAPES/ANIMAL KINGDOM/PLANT TREES AND FLOWERS/FRUITS AND VEGETABLES/FIVE ELEMENTS); load initial selections for the school and include them in the save action payload used by hooks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/packing/packingOptions.ts",
          "operation": "create",
          "description": "Create shared constants for the exact Class and Theme option labels (English) used by the Packing UI to avoid drift and ensure the option sets remain exact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/adjust Packing-related query/mutation hooks so the UI can persist and reload class/theme selections per school (using backend capabilities when available and demo-local persistence when demo mode is active); keep React Query cache keys consistent and invalidate appropriately after saves. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Add a labeled counts section on the Packing page to edit and save counts associated with the selected Class and Theme, with validation and persistence/reload behavior (including demo mode).",
      "acceptanceCriteria": [
        "Packing page includes a dedicated counts section that is clearly labeled in English.",
        "Counts are editable inputs and are saved together with the packing status update for the school.",
        "After saving, a refresh/re-open of the page shows the same saved counts for that school along with the saved class/theme selections.",
        "Validation prevents negative values and displays a clear English error message when invalid input is provided."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/packing/SchoolPackingPage.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled English 'Counts' section tied to the currently selected Class and Theme; include editable numeric inputs, prevent negative values, and show an English validation error message; save counts together with the school’s packing update flow and reload them on revisit. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement React Query hooks for reading and writing Packing counts for a school keyed by Class+Theme, including demo-mode local persistence and appropriate cache invalidation so revisiting/refreshing reloads the saved values. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Add an Admin-only workflow to search/select a school and set/update its Outstanding Amount, showing selected school details read-only and guarding access in the UI.",
      "acceptanceCriteria": [
        "Admin area provides a school search/select UI and a view for the selected school that shows school details read-only.",
        "Admin can input and save an Outstanding Amount for the selected school.",
        "Outstanding Amount is persisted in backend state and reloaded correctly for the selected school.",
        "Non-admin users cannot access the admin outstanding editor (route guarded in frontend, and backend rejects unauthorized updates).",
        "All user-facing labels/messages are in English (e.g., “Outstanding Amount (₹)”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/OutstandingAmountPage.tsx",
          "operation": "create",
          "description": "Create an Admin Outstanding Amount editor page with a school search/select UI, a read-only school details panel, and an editable 'Outstanding Amount (₹)' field that saves and reloads values; ensure all user-facing text is English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add outstanding-amount query/mutation hooks (get/has/set) with demo-mode local persistence support and React Query invalidation so Admin saves immediately reflect across modules. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/schools/SchoolSearchPanel.tsx",
          "operation": "modify",
          "description": "Support a selection workflow usable by the Admin outstanding editor (e.g., allow passing an onSelect handler and optionally hide the external-link action column) while keeping existing usages intact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/routeTree.tsx",
          "operation": "modify",
          "description": "Add and wire an admin-only route for the Outstanding Amount editor and guard it using the app’s role-based authorization patterns (ensure non-admins are redirected or shown an access denied state). Use the authorization component’s RBAC patterns to drive the guard and UI behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/dashboards/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add an Admin-accessible navigation entry (button/link) to the Outstanding Amount editor page so the workflow is discoverable; keep labels in English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Display each school’s Outstanding Amount read-only in the Marketing module when viewing/selecting a school, with a consistent 'Not set' (or 0) state.",
      "acceptanceCriteria": [
        "Marketing users can see a read-only Outstanding Amount value for a selected school (wherever school details are shown in the Marketing module).",
        "If no outstanding is set yet for a school, the UI shows 0 or an explicit English “Not set” state (choose one and apply consistently).",
        "Outstanding Amount displayed in Marketing matches the value saved from the Admin workflow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/schools/SchoolDetailsPage.tsx",
          "operation": "modify",
          "description": "Show a read-only Outstanding Amount section on the school details view (used by Marketing when viewing a school); display an explicit English 'Not set' state when no outstanding exists, otherwise show the amount (₹) consistently. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure outstanding amount hooks support both: (1) checking whether an amount is set and (2) retrieving the amount; use consistent query keys so Marketing views reflect Admin updates via cache invalidation. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Make Demo/Preview Mode core flows work end-to-end using demo-local persisted data: school registration, cross-page reflection, outstanding updates, and packing edits with reload persistence and graceful errors.",
      "acceptanceCriteria": [
        "In Demo/Preview Mode, creating a school from the Marketing school registration page adds the school to the demo school list and it becomes searchable/visible across dashboards and modules without reload issues.",
        "In Demo/Preview Mode, Admin can set Outstanding Amount for a school and Marketing can see the same value for that school.",
        "In Demo/Preview Mode, Packing edits (class/theme + counts + packing flags/dispatch details) can be saved and then reloaded, and the demo data persists across navigation (and optionally across browser refresh via localStorage).",
        "Demo/Preview Mode does not hard-crash on any of these pages; failures show clear English messages only when truly necessary.",
        "Demo-mode data behavior is consistent across: school list queries, school detail queries, packing status queries, and outstanding queries."
      ],
      "file_operations": [
        {
          "path": "frontend/src/demo/demoDataStore.ts",
          "operation": "create",
          "description": "Implement a demo-local persistence layer (localStorage-backed) for schools, outstanding amounts, packing status, and packing class/theme/counts so demo flows work end-to-end across navigation and optional refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update school, packing, and outstanding queries/mutations to use demoDataStore when demo mode is active (instead of returning empty arrays/throwing), ensuring consistent behavior and React Query cache invalidation across modules. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/marketing/SchoolCreatePage.tsx",
          "operation": "modify",
          "description": "Enable school registration in Demo/Preview Mode by removing demo-mode mutation blocking for this flow and relying on demo-backed mutations; ensure created schools become searchable immediately across modules and keep all UI text in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/packing/SchoolPackingPage.tsx",
          "operation": "modify",
          "description": "Enable saving packing edits in Demo/Preview Mode (class/theme, counts, packing flags, dispatch details) via demo-backed mutations; ensure reload/revisit shows saved demo values and errors are clear English messages only when necessary. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/OutstandingAmountPage.tsx",
          "operation": "modify",
          "description": "Ensure the Outstanding Amount admin editor reads/writes demo-local values in Demo/Preview Mode and updates reflect immediately in Marketing/school details views. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/schools/SchoolSearchPanel.tsx",
          "operation": "modify",
          "description": "Ensure the schools search panel works in Demo/Preview Mode by consuming demo-backed school lists and updating results immediately after demo school creation, without reload issues. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Provide an Admin-accessible UI entry point to register schools (create school) in non-demo mode, reusing existing school registration behavior and ensuring new schools appear immediately across modules.",
      "acceptanceCriteria": [
        "Backend allows Admin role to create schools (in addition to existing Marketing capability) while keeping other roles blocked.",
        "Frontend provides an Admin-accessible entry point to create/register a school (reusing the existing school registration form behavior and validation), and the new school appears in school searches/lists after creation.",
        "RBAC remains enforced: non-admin, non-marketing users cannot create schools (backend rejects, frontend hides/blocks)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/routeTree.tsx",
          "operation": "modify",
          "description": "Add an Admin route to access school registration (reusing the existing school creation page/component) and guard it using role-based authorization checks; ensure unauthorized roles cannot navigate to it. Use the authorization component’s RBAC patterns to drive the guard and UI behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/dashboards/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add an English-labeled Admin-only button/link to 'Register School' that navigates to the Admin school creation entry point. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/marketing/SchoolCreatePage.tsx",
          "operation": "modify",
          "description": "Refactor to support reuse from both Marketing and Admin entry points (e.g., configurable post-create redirect) while keeping the same validation and ensuring school lists/search results refresh after creation in non-demo mode. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}