{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Light-mode solid white surfaces for Demo role switcher dropdown and Training Visit form",
  "requirements": [
    {
      "id": "REQ-58",
      "summary": "Ensure the Demo/Preview Mode role switcher trigger and dropdown content render with solid white backgrounds in light mode while preserving existing dark-mode styling and behavior.",
      "acceptanceCriteria": [
        "When Demo/Preview Mode is active, the role switcher SelectTrigger in the top banner renders with a solid white background in light mode.",
        "When the role switcher dropdown is opened, the dropdown content surface renders with a solid white background in light mode (no transparency).",
        "In dark mode, the role switcher retains the existing dark-mode look and remains readable (do not force a white background in dark mode).",
        "No changes to role-switching behavior: selecting a role still updates the demo role and navigates to the correct dashboard route."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/demo/DemoPreviewBanner.tsx",
          "operation": "modify",
          "description": "Update the role switcher SelectTrigger and SelectContent className styling to force a solid white surface in light mode (e.g., bg-white and non-transparent overrides), while explicitly preserving the existing dark-mode surface tokens via dark: classes. Keep all role-switching logic unchanged and avoid touching any files under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Ensure the Training Visit create/edit dialog’s form container renders with a solid white background in light mode while preserving existing dark-mode styling and functionality.",
      "acceptanceCriteria": [
        "On the Training Visits page, opening the Log Visit dialog shows the entire form container with a solid white background in light mode (no transparency).",
        "On the Training Visits page, opening the Edit Training Visit dialog shows the entire form container with a solid white background in light mode (no transparency).",
        "In dark mode, the dialog keeps the existing dark-mode background tokens and remains readable (do not force a white background in dark mode).",
        "Opening and closing the dialog, saving, and canceling do not produce runtime errors and do not break Demo/Preview Mode behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/training/SchoolTrainingPage.tsx",
          "operation": "modify",
          "description": "Adjust the Create/Edit Visit DialogContent styling so the entire visit form container uses a solid white background in light mode (e.g., bg-white) and preserves existing dark-mode styling via dark: classes (keep current tokens/behavior for dark mode). Scope changes only to the training visit dialog (not global styles) and do not modify any files under frontend/src/components/ui."
        }
      ]
    }
  ]
}