{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Admin initial-load invalid hook crash & improve error boundary diagnostics",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Eliminate the Admin first-load crash by fixing the invalid React hook call in the Admin initial render path so the Admin dashboard renders successfully as the first route.",
      "acceptanceCriteria": [
        "Opening the app when the Admin page is the first route no longer shows the GlobalErrorBoundary screen.",
        "No “Minified React error #185” appears in the UI or browser console during initial load.",
        "All React hooks used by the Admin initial render path are invoked only inside valid React function components or custom hooks (no hooks executed at module scope, inside non-component functions, or conditionally in a way that violates the Rules of Hooks)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit the app bootstrap composition (Router + React Query + error boundary) to ensure no route component (including Admin) is ever rendered outside the Router provider, and that any router/query client creation is stable and not causing invalid hook call conditions during initial navigation to an Admin route."
        },
        {
          "path": "frontend/src/routeTree.tsx",
          "operation": "modify",
          "description": "Review Admin route wiring to ensure the initial Admin render path does not evaluate any hook-using code outside of React components (e.g., avoid executing component logic at module initialization; keep route definitions purely declarative)."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Harden initial-load logic so auth/profile gating cannot trigger invalid render paths during the first paint on an Admin route (e.g., ensure navigation side-effects do not cause premature rendering of protected content before required context is ready)."
        },
        {
          "path": "frontend/src/pages/dashboards/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Validate and adjust Admin dashboard initial queries/derived computations to ensure hooks are used only at the top level of the component and are not invoked conditionally via helper invocations or module-scope execution in the Admin initial render path."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit hooks used by the Admin dashboard path to ensure they follow the Rules of Hooks and do not execute hook logic indirectly at module scope; refactor any Admin-critical query helpers if they can evaluate hook code outside component/custom-hook context."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve GlobalErrorBoundary “Technical Details” to show actionable diagnostics for React #185 (raw message + component stack when available) without causing secondary crashes, keeping user-facing text in English.",
      "acceptanceCriteria": [
        "When an error occurs, the error boundary still renders without throwing additional errors.",
        "Clicking “Technical Details” reveals the component stack (when available) and does not break the page.",
        "User-facing error boundary strings remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/error/GlobalErrorBoundary.tsx",
          "operation": "modify",
          "description": "Enhance the error boundary details panel to safely render: raw error name/message, best-effort component stack, and stack trace, with defensive guards so the Technical Details toggle never throws even when fields are missing or non-standard."
        },
        {
          "path": "frontend/src/utils/getErrorMessage.ts",
          "operation": "modify",
          "description": "Improve error message extraction for React #185/invalid hook call scenarios by preserving the raw error message when available, handling non-Error throws safely, and avoiding any formatting that could itself throw."
        }
      ]
    }
  ]
}