{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Role-based UI update: move the \"Register New School\" navigation item from the Marketing Dashboard to the Admin Dashboard, and restrict Marketing users to view-only access for school details (remove Register and Edit actions).",
  "architectural_notes": [
    "Enforce role-based access in UI: Admin can register schools; Marketing is view-only (no register/edit actions)."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-move-the-register-school-navigation-entry-from-the-marketing-ui-to-the-admin-ui-so-that-admin-users-see-a-register-school-item-in-the-top-navigation-header-next-to-the-existing-admin-items-and-marketing-users-no-longer-see-any-register-school-navigation-entry",
      "title": "Move the “Register School” navigation entry from the Marketing UI to the Admin UI so that Admin users see a “Register School” item in the top navigation (header) next to the existing Admin items, and Marketing users no longer see any “Register School” navigation entry.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-update-routing-so-the-school-registration-page-is-accessible-from-an-admin-route-e-g-under-admin-and-is-not-accessible-to-marketing-users-if-a-marketing-user-attempts-to-access-the-old-marketing-registration-route-directly-redirect-them-to-the-marketing-dashboard-or-an-authorized-page",
      "title": "Update routing so the school registration page is accessible from an Admin route (e.g., under /admin/...) and is not accessible to Marketing users. If a Marketing user attempts to access the old Marketing registration route directly, redirect them to the Marketing dashboard (or an authorized page).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-restrict-marketing-to-view-only-access-on-the-school-details-page-by-removing-the-edit-action-for-marketing-users-and-ensuring-the-form-fields-remain-read-only-for-them",
      "title": "Restrict Marketing to view-only access on the School Details page by removing the Edit action for Marketing users and ensuring the form fields remain read-only for them.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Move \"Register New School\" option from Marketing Dashboard to Admin Dashboard navigation (next to existing nav items)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Restrict Marketing role to view-only for school details by removing Register and Edit options from Marketing UI",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Enforce backend authorization so Marketing users cannot create new schools or update school details via API calls, even if they attempt to bypass the UI; Admin users must retain these capabilities.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Move “Register School” to Admin navigation and make Marketing view-only for schools",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}